# Напишите код, который принимает список слов и возвращает новый список,
# отсортированный по алфавиту. Используйте функцию sorted.

somewords = ['apple', 'banana', 'cherry','pineapple']
print(sorted(somewords))