# Напишите код, который принимает список чисел и возвращает новый список,
# содержащий квадраты этих чисел. Используйте функцию map и lambda.
list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 111, 2222, 34665, 778676, 88]
print(list(map(lambda x: x**2, list1)))