# Напишите код, который принимает список кортежей вида (имя, возраст) и
# возвращает новый список, отсортированный по возрастанию возраста.
# Используйте функцию sorted и ключ сортировки.
list = [('Name', 16), ('John', 30), ('Alice', 34), ('Paul', 4)]
sorted_age = sorted(list, key=lambda x: x[1])
print(sorted_age)