# Расстояние в метрах
# Напишите программу, которая находит полное число метров по
# заданному числу сантиметров.

# a = int(input())
# print(a // 100 , "метров")

# В одну строчку:
print(int(input()) // 100 , "метров")