# Пересчет временного интервала
# Напишите программу для пересчёта величины временного интервала,
# заданного в минутах, в величину, выраженную в часах и минутах.

a = int(input())
print(a , "мин - это" , a // 60 , "час", a % 60 , "мин")

