# Квадрат
# Написать программу, принимающую 1 аргумент — сторону квадрата, и
# возвращающую 3 значения: периметр квадрата, площадь квадрата и
# диагональ квадрата.

a = int(input())
print("Периметр:" , a * 4 , "Площадь:" , a ** 2, "Диагональ:" , a * (2 ** (1 / 2)))

# С использованием библиотеки math:
# import math
# a = int(input())
# print("Периметр:" , a * 4 , "Площадь:" , a ** 2, "Диагональ:" , a * math.sqrt(2))