# Четное или нечетное?
# Напишите программу, которая определяет, является число четным или
# нечетным.
from selectors import SelectSelector

a = int(input())
if a % 2 == 0 :
    print("Четное")
else :
    print("Нечетное")