# Трехзначное число
# Напишите программу, в которой рассчитывается сумма и произведение
# цифр положительного трёхзначного числа.
a = int(input())
print("Сумма:" , (a // 100 + a % 100 // 10 + a % 100 % 10))
print("Произведение:" , (a // 100 * a % 100 // 10 * a % 100 % 10))