# Задание 3
# На вход пользователь вводит целое число (использовать функцию input).
# Используя цикл, вывести в консоль все числа от 1 до введенного числа включительно.
# Используя цикл, вывести в консоль все числа от введенного числа до 1 включительно.
# Используя цикл, вывести в консоль все числа от 1 до введенного числа включительно, которые делятся на 3 без остатка.
number = int(input())

for i in range(1, number + 1):
    print(i)

for i in range(number, 0, -1):
    print(i)

for i in range(1, number + 1):
    if i % 3 == 0:
        print(i)
