# Задание 4
# На вход пользователь вводит предложение (использовать функцию input).
# Посчитайте количество слов в предложении и выведите результат в консоль.
# Используя цикл, выведите в консоль все слова предложения в обратном порядке.
# Используя цикл, создайте словарь, где ключами являются длина слов,
#           а значениями - список слов в предложении с такой длиной.

# На вход пользователь вводит предложение (использовать функцию input).
sentence = input()

# Посчитайте количество слов в предложении и выведите результат в консоль.
words = sentence.split()
print(f'количество: {len(words)} слов')

# Используя цикл, выведите в консоль все слова предложения в обратном порядке.
reversed_list =[]

for i in range(len(words) - 1, -1, -1):
    reversed_list.append(words[i])
print('предложение наоборот:', reversed_list)

# Используя цикл, создайте словарь, где ключами являются длина слов,
#           а значениями - список слов в предложении с такой длиной.

new_dict = {}
for word in words:
    length = len(word)
    new_list = new_dict.get(length) # создание списка из слов одинаковой длинны
    if new_list is None:
        new_dict[length] = [word]
    else:
        new_list.append(word)
print(new_dict)
