# Задание 6*
# Напишите в коде случайное число от 1 до 100.
# Пользователь должен угадать это число.
# Используя цикл, попросите пользователя ввести число до тех пор, пока он не угадает.
# Если пользователь ввел не число, выведите сообщение "Вы ввели не число".
# Если пользователь ввел число, которое не попало в диапазон от 1 до 100, выведите сообщение "Число не входит в диапазон от 1 до 100".
# Если пользователь ввел число больше загаданного, выведите сообщение "Загаданное число меньше".
# Если пользователь ввел число меньше загаданного, выведите сообщение "Загаданное число больше".
# Если пользователь угадал число, выведите сообщение "Вы угадали!" и завершите программу.
number = 17
while True:
    try:
        user_number = int(input('Введите число: '))

        if user_number == number:
            print('Число верное')
            break
        elif user_number not in range(1, 101):
            print('Число не входит в диапазон от 1 до 100')
        elif user_number > number:
            print('Загаданное число меньше')
        elif user_number < number:
            print('Загаданное число больше')

    except ValueError:
        print('Вы ввели не число')
