# Задание 4.
# Напишите функцию, которая принимает на вход строку и возвращает True,
# если строка является палиндромом, и False - в противном случае.
#       Палиндром - это строка, которая читается одинаково в обоих направлениях.
#       Например: 'мадам', 'А роза упала на лапу Азора'
def is_palindrome(text):
    text = text.lower() # заглавные буквы => строчные
    text = text.split()
    text = ''.join(text) # удаление пробелов
    reversed_text = text[::-1]
    return text == reversed_text

print(is_palindrome(input()))