# Задание 3
# На вход пользователь вводит целое число (использовать функцию input).
# Используя цикл, вывести в консоль все числа от 1 до введенного числа включительно.
# Используя цикл, вывести в консоль все числа от введенного числа до 1 включительно.
# Используя цикл, вывести в консоль все числа от 1 до введенного числа включительно, которые делятся на 3 без остатка.

# C помощью цикла for:

number = int(input())
for i in range(1, number + 1):
    print(i) # вывести в консоль все числа от 1 до введенного числа включительно.
for i in range(number, 0, -1):
    print(i) # вывести в консоль все числа от введенного числа до 1 включительно.
for i in range(number + 1):
    if i % 3 == 0:
        print(i) # вывести в консоль все числа от 1 до введенного числа включительно, которые делятся на 3 без остатка.

# C помощью цикла while:

number1 = int(input())
list1 = []
while (number1 - 1) >= 0:
    list1.append(number1) # в пустой список добавляем число, равное ВВОД - 1
    number1 = number1 - 1
print(list1[: :-1]) # выводим список в обратном порядке: от 0 до ВВОД
print(list1) # выводим список в прямом порядке: от ВВОД до 0

list2 = []
for number2 in list1[: :-1]:
    if number2 % 3 == 0:
        list2.append(number2)
print(list2)


