# Задание 4
# На вход пользователь вводит предложение (использовать функцию input).
# Посчитайте количество слов в предложении и выведите результат в консоль.
# Используя цикл, выведите в консоль все слова предложения в обратном порядке.
# Используя цикл, создайте словарь, где ключами являются длина слов,
#           а значениями - список слов в предложении с такой длиной.
class Coordinates:
    __slots__ = ['x', 'y']

    def __init__(self, x, y):
        self.x = x
        self.y = y

c1 = Coordinates(1, 2)
print(c1)
